from aiogram import Router
from aiogram.types import Message
from aiogram.filters import Command
from sqlalchemy.ext.asyncio import AsyncSession

router = Router()


@router.message(Command("help"))
async def help_cmd(message: Message, session: AsyncSession):
    await message.answer(
        "📌 Команды бота\n\n"
        "🛠 Администраторы:\n"
        "/createrole <имя> - создать роль\n"
        "/deleterole <имя> - удалить роль\n"
        "/registeruser <username> - зарегистрировать участника\n"
        "/unregisteruser <username> - удалить участника\n" 
        "/addroleuser <роль> <username|никнейм> — добавить роль участнику\n"
        "/removeroleuser <роль> <username|никнейм> — удалить роль участнику\n"
        '/setnicknameuser <username> <никнейм> — установить никнейм участнику\n\n'
        "👥 Пользовательские:\n"
        "/myinfo — моя информация\n"
        "/mystatus — мой статус\n"
        "/myroles — мои роли\n"
        "/mynickname — мой никнейм\n\n"
        "/userinfo <username|никнейм> — информация участника\n"
        "/userstatus <username|никнейм> — статус участника\n"
        "/userroles <username|никнейм> — роли участника\n"
        "/usernick <username> — никнейм участника\n\n"
        "/registerme — зарегистрироваться\n"
        "/unregisterme — удалить себя из базы данных\n"
        "/setnicknameme <никнейм> — установить никнейм\n"
        "/setactive — установить статус \"активный\"\n"
        "/setinactive — установить статус \"неактивный\"\n\n"
        "/addroleme <роль> — добавить роль(и) себе\n"
        "/removeroleme <роль> — удалить роль(и) себе\n"
        "/roleslist - список всех ролей\n"
        "/roleusers <роль> — список участников с ролью\n\n"
        "/callrole <роль> — вызвать всех участников с ролью\n"
        "/calluser <никнейм> - вызвать участника\n\n"
    )